Tekla Open API Reference for Tekla Structures 2025
PrinterItemEnumerator.Reset Method
 Resets the enumerator to the beginning.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public void Reset()
Public Sub Reset
Implements
IEnumerator.Reset()
See Also
Reference
PrinterItemEnumerator Class
Tekla.Structures.Catalogs Namespace